{"title":"folklore","short_description":"When the global covid pandemic broke out in 2020, the planned Lover tour had to be canceled. With the sudden lockdown came folklore, Swift’s eighth studio album and first surprise album, announced only 16 hours prior its release at midnight. The album is the result of experimentation, imagination and the joy of storytelling.","spotify":"https://open.spotify.com/album/1pzvBxYgT6OVwJLtHkrdQK","apple_music":"https://music.apple.com/album/folklore-deluxe-version/1528112358","amazon_music":"https://music.amazon.de/albums/B08G4T9CQS","youtube_music":"https://music.youtube.com/playlist?list=OLAK5uy_kAP6NlfZyjLsZRfwthCuA1yfeX6rLq8l8","wikipedia":"https://en.wikipedia.org/wiki/Folklore_(Taylor_Swift_album)","song_sets":{"main":{"release":"24-07-2020","1":"the 1","2":"cardigan","3":"the last great american dynasty","4":"exile","5":"my tears ricochet","6":"mirrorball","7":"seven","8":"august","9":"this is me trying","10":"illicit affairs","11":"invisible string","12":"mad woman","13":"epiphany","14":"betty","15":"peace","16":"hoax"},"Deluxe Edition":{"release":"24-07-2020","17":"the lakes"}},"paragraphs":{"count":1,"0":{"title":"Introduction","text":"“It started with imagery. Visuals that popped into my mind and piqued my curiosity. Stars drawn around scars. A cardigan that still bears the scent of loss twenty years later. Battleships sinking into the ocean, down, down, down. The tree swing in the woods of my childhood. Hushed tones of \"let's run away\" and never doing it. The sun drenched month of August, sipped away like a bottle of wine. A mirrored disco ball hovering above a dance floor. A whiskey bottle beckoning. Hands held through plastic. A single thread that, for better or for worse, ties you to your fate. Pretty soon these images in my head grew faces or names and became characters. I found myself not only writing my own stories, but also writing about or from the perspective of people I've never met, people I've known, or those I wish I hadn't.”\n– Taylor Swift on Billboard."}}}