{"0101":[{"year":2000,"subject":"A Monster in My Closet! was published when Swift won a national poetry contest held by Creative Communcation.","url":"https://www.poeticpower.com/taylorswiftpoem"}],"2901":[{"year":2009,"subject":"Swift's first headlining tour, the Fearless Tour, was announced."}],"2301":[{"year":2020,"subject":"The Miss Americana documentary premiered at the opening night of the Sundance Film Festival."}],"2701":[{"year":2023,"subject":"The music video for Lavender Haze premiered."}],"0202":[{"year":2019,"subject":"The owner of the stan Twitter account “Taylor Swift Updates” went to jail for refusing to join the IDF.","url":"https://www.vice.com/en/article/gyazzj/meet-the-taylor-swift-stan-who-went-to-jail"}],"0902":[{"year":2011,"subject":"The Speak Now World Tour kicked off in Singapore."}],"1202":[{"year":2021,"subject":"Love Story (Taylor's Version) was released as a single two months prior Fearless (TV)."}],"1402":[{"year":2023,"subject":"Republic Records released a heart-shaped vinyl featuring Lover (Live from Paris) from 2019."}],"1802":[{"year":2011,"subject":"Taylor Swift appeared on Take Two with Phineas and Ferb."}],"2702":[{"year":2021,"subject":"The Lover Fest world tour was canceled due to the Covid-19 pandemic."}],"1303":[{"year":2023,"subject":"Glendale's mayor announced to change the city name to “Swift City” from 17th to 18th March."},{"year":2013,"subject":"The RED Tour kicked off in Omaha."}],"1803":[{"year":2008,"subject":"Taylor Swift (the album) was released internationally."},{"year":2012,"subject":"The Speak Now World Tour ends in Auckland after 110 shows and more than 1.6 million visitors."}],"1703":[{"year":2023,"subject":"The Eras Tour kicked off in Glendale."},{"year":2023,"subject":"All of the Girls You Loved Before, as well as the Taylor's Version's of Eyes Open, Safe & Sound and If This Was a Movie were released to celebrate The Eras Tour."}],"2304":[{"year":2009,"subject":"The Fearless Tour kicked off in Evansville."}],"0204":[{"year":2019,"subject":"The owner of the stan Twitter account “Taylor Swift Updates” reported that they are back from prison.","url":"https://www.vice.com/en/article/gyazzj/meet-the-taylor-swift-stan-who-went-to-jail"}],"0904":[{"year":2021,"subject":"Fearless (Taylor's Version) was released."}],"0505":[{"year":2015,"subject":"The 1989 World Tour kicked off in Tokyo."},{"year":2023,"subject":"Swift announced the release of Speak Now (Taylor's Version) at The Eras Tour in Nashville."}],"1705":[{"year":2020,"subject":"Taylor Swift: City of Lover aired on ABC, featuring Swift’s concert from September 2019 in Paris."}],"0805":[{"year":2018,"subject":"The Reputation Stadium Tour kicked off in Glendale."}],"2605":[{"year":2023,"subject":"The music video for Karma premiered."}],"0206":[{"year":2023,"subject":"The Eras Tour dates for Latin America were announced."}],"0406":[{"year":2006,"subject":"The Wikipedia article about Taylor Swift was created.","url":"https://en.wikipedia.org/w/index.php?title=Taylor_Swift&oldid=56860188"}],"1206":[{"year":2014,"subject":"The RED Tour ends in Singapore after 86 shows and 1.7 million visitors."}],"0906":[{"year":2017,"subject":"After almost 3 years, Swift's music became available on Spotify again."}],"1906":[{"year":2006,"subject":"Swift's debut single Tim McGraw was released."}],"2006":[{"year":2023,"subject":"The Eras Tour dates for Asia, Australia and Europe were announced."}],"1007":[{"year":2010,"subject":"The Fearless Tour ends in Cavendish after 111 shows and 1.2 million visitors."},{"year":2019,"subject":"Forbes named Swift the world's highest paid entertainer."}],"2407":[{"year":2020,"subject":"Folklore was released."}],"0707":[{"year":2023,"subject":"The music video of I Can See You premiered at The Eras Tour in Kansas."},{"year":2023,"subject":"Speak Now (Taylor's Version) was released."}],"1307":[{"year":2023,"subject":"A delxuxe edition of Speak Now (Taylor's Version) was released."}],"2207":[{"year":2006,"subject":"The music video of Tim McGraw premiered on Great American Country."}],"2608":[{"year":2015,"subject":"Swift performed Smelly Cat with Lisa Kudrow (Phoebe Buffay) at The 1989 World Tour in Los Angeles."},{"year":2019,"subject":"By performing You Need to Calm Down and Lover, Taylor Swift turned the MTV Video Music Awards into her own concert."}],"0908":[{"year":2023,"subject":"Swift announced the release of 1989 (Taylor's Version) at The Eras Tour in Los Angeles."}],"1308":[{"year":2012,"subject":"Red's lead single We Are Never Ever Getting Back Together was released."}],"2308":[{"year":2019,"subject":"Lover was released."}],"2808":[{"year":2022,"subject":"Swift won three out of five nominations at the MTV Video Music Awards. In her acceptance speech, she announced the release of Midnights."}],"3108":[{"year":2023,"subject":"Swift announced the Taylor Swift: The Eras Tour concert film."}],"0909":[{"year":2019,"subject":"Swift performed at the L'Olympia Theater in Paris. Her concert was recorded and aired in May 2020, titled “Taylor Swift: City of Lover”."}],"1709":[{"year":2019,"subject":"The Lover Fest was announced. It later was canceled due to the Covid-19 pandemic."}],"2109":[{"year":2022,"subject":"Swift began to reveal Midnights' song titles by releasing the first episode of Midnights Mayhem with Me."}],"2210":[{"year":2012,"subject":"Red was released."}],"2410":[{"year":2006,"subject":"Taylor Swift (the album) was released in North America."}],"2510":[{"year":2010,"subject":"Speak Now was released."},{"year":2012,"subject":"Swift announced The RED Tour."},{"year":2022,"subject":"The music video for Bejeweled premiered."}],"1310":[{"year":2023,"subject":"The Taylor Swift: The Eras Tour concert film premiered in North American cinemas."},{"year":2023,"subject":"The concert film of The Eras Tour was released to North American cinemas."}],"2110":[{"year":2022,"subject":"Midnights was released."},{"year":2022,"subject":"The music video for Anti-Hero premiered."}],"2710":[{"year":2014,"subject":"1989 was released."},{"year":2023,"subject":"1989 (Taylor's Version) was released."}],"3110":[{"year":2022,"subject":"Swift became the first artist to claim all top 10 slots on the Billboard Hot 100 charts."}],"0311":[{"year":2014,"subject":"The 1989 World Tour was announced."},{"year":2014,"subject":"Swift removes her music from Spotify.","url":"https://time.com/3554438/taylor-swift-spotify/"}],"0411":[{"year":2004,"subject":"Scott Borchetta went to the Bluebird Cafe to see Taylor Swift play before offering her a contract with his new record label, Big Machine Records (Swift's former label).","url":"https://www.billboard.com/music/country/the-bluebird-cafe-taylor-swift-dierks-bentley-oral-history-7880979/"}],"1311":[{"year":2017,"subject":"First dates of the Reputation Stadium Tour were announced."}],"2111":[{"year":2018,"subject":"The Reputation Stadium Tour ends in Tokyo after 53 shows and almost 2.9 million visitors."}],"2311":[{"year":2010,"subject":"Swift's second headlining tour – the Speak Now World Tour – was announced."}],"0111":[{"year":2022,"subject":"Swift announced The Eras Tour."}],"1011":[{"year":2017,"subject":"Reputation was released."}],"1111":[{"year":2008,"subject":"Fearless was released in the US."}],"1211":[{"year":2021,"subject":"All Too Well: The Short Film premiered."},{"year":2021,"subject":"Red (Taylor's Version) was released."}],"1511":[{"year":2022,"subject":"With 2 million tickets sold, The Eras Tour sold the most tickets on a single day."},{"year":2022,"subject":"The first US presale of The Eras Tour caused Ticketmaster to crash.","url":"https://en.wikipedia.org/wiki/2022_Ticketmaster_controversy"}],"2511":[{"year":2020,"subject":"Folklore: The Long Pond Studio Sessions premiered on Disney+."}],"1112":[{"year":2020,"subject":"Evermore was released."}],"1312":[{"year":1989,"subject":"Taylor Swift was born in West Reading, Pennsylvania."}],"1212":[{"year":2015,"subject":"The 1989 World Tour ends in Melbourne after 85 shows and almost 2.3 million visitors."}],"2012":[{"year":2015,"subject":"The 1989 World Tour Live concert film premiered on Apple Music."}],"3112":[{"year":2018,"subject":"Taylor Swift: Reputation Stadium Tour premiered on Netflix."}]}